mikeakohn/naken_asm/include/8051/EFM8SB2.inc
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;
;; EFM8SB2 include
;; part of the naken_asm assembler
;;
;; Generated by: Michael Kohn (mike@mikekohn.net)
;;         Date: 2022-04-23
;;        Parts: EFM8 / EFM8SB2 / Sleepy Bee
;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;P0      equ 0x80
;SP      equ 0x81
DPL      equ 0x82
DPH      equ 0x83
SPI1CFG  equ 0x84  ; page 0
SPI1CKR  equ 0x85  ; page 0
SPI1DAT  equ 0x86  ; page 0
TOFFL    equ 0x85  ; page f
TOFFH    equ 0x86  ; page f
PCON0    equ 0x87
;TCON    equ 0x88  ; page 0
;TMOD    equ 0x89  ; page 0
;TL0     equ 0x8a  ; page 0
;TL1     equ 0x8b  ; page 0
;TH0     equ 0x8c  ; page 0
;TH1     equ 0x8d  ; page 0
;CKCON0  equ 0x8e  ; page 0
PSCTL    equ 0x8f  ; page 0
;P1      equ 0x90
TMR3CN0  equ 0x91  ; page 0
TMR3RLL  equ 0x92  ; page 0
TMR3RLH  equ 0x93  ; page 0
TMR3L    equ 0x94  ; page 0
TMR3H    equ 0x95  ; page 0
CRC0DAT  equ 0x91  ; page f
CRC0CN0  equ 0x92  ; page f
CRC0IN   equ 0x93  ; page f
CRC0FLIP equ 0x95  ; page f
CRC0AUTO equ 0x96  ; page f
CRC0CNT  equ 0x97  ; page f
SCON0    equ 0x98  ; page 0
SBUF0    equ 0x99  ; page 0
CMP1CN0  equ 0x9a  ; page 0
CMP0CN0  equ 0x9b  ; page 0
CMP1MD   equ 0x9c  ; page 0
CMP0MD   equ 0x9d  ; page 0
CMP1MX   equ 0x9e  ; page 0
CMP0MX   equ 0x9f  ; page 0
;P2      equ 0xa0  ; page 0
SPI0CFG  equ 0xa1  ; page 0
SPI0CKR  equ 0xa2  ; page 0
SPI0DAT  equ 0xa3  ; page 0
P0MDOUT  equ 0xa4  ; page 0
P1MDOUT  equ 0xa5  ; page 0
P2MDOUT  equ 0xa6  ; page 0
P0DRV    equ 0xa4  ; page f
P1DRV    equ 0xa5  ; page f
P2DRV    equ 0xa6  ; page f
SFRPAGE  equ 0xa7
;IE      equ 0xa8
CLKSEL   equ 0xa9
EMI0CN   equ 0xaa ; page 0
EMI0CF   equ 0xab ; page 0
RTC0ADR  equ 0xac ; page 0
RTC0DAT  equ 0xad ; page 0
RTC0KEY  equ 0xae ; page 0
EMI0TC   equ 0xaf ; page 0
SPI1CN0  equ 0xb0 ; page 0
XOSC0CN  equ 0xb1 ; page 0
HFO0CN   equ 0xb2 ; page 0
HFO0CAL  equ 0xb3 ; page 0
PMU0CF   equ 0xb5 ; page 0
FLSCL    equ 0xb6 ; page 0
FLKEY    equ 0xb7 ; page 0
;IP      equ 0xb8
IREF0CN0 equ 0xb9 ; page 0
ADC0AC   equ 0xba ; page 0
ADC0MX   equ 0xbb ; page 0
ADC0CF   equ 0xbc ; page 0
ADC0L    equ 0xbd ; page 0
ADC0H    equ 0xbe ; page 0
P1MASK   equ 0xbf ; page 0
ADC0PWR  equ 0xba ; page f
ADC0TK   equ 0xbd ; page f
SMB0CN0  equ 0xc0 ; page 0
SMB0CF   equ 0xc1 ; page 0
SMB0DAT  equ 0xc2 ; page 0
ADC0GTL  equ 0xc3 ; page 0
ADC0GTH  equ 0xc4 ; page 0
ADC0LTL  equ 0xc5 ; page 0
ADC0LTH  equ 0xc6 ; page 0
P0MASK   equ 0xc7 ; page 0
TMR2CN0  equ 0xc8 ; page 0
REG0CN   equ 0xc9 ; page 0
TMR2RLL  equ 0xca ; page 0
TMR2RLH  equ 0xcb ; page 0
TMR2L    equ 0xcc ; page 0
TMR2H    equ 0xcd ; page 0
PCA0CPM5 equ 0xce ; page 0
P1MAT    equ 0xcf ; page 0
;PSW     equ 0xd0
REF0CN   equ 0xd1 ; page 0
PCA0CPL5 equ 0xd2 ; page 0
PCA0CPH5 equ 0xd3 ; page 0
P0SKIP   equ 0xd4 ; page 0
P1SKIP   equ 0xd5 ; page 0
P2SKIP   equ 0xd6 ; page 0
P0MAT    equ 0xd7 ; page 0
PCA0CN0  equ 0xd8 ; page 0
PCA0MD   equ 0xd9 ; page 0
PCA0CPM0 equ 0xda ; page 0
PCA0CPM1 equ 0xdb ; page 0
PCA0CPM2 equ 0xdc ; page 0
PCA0CPM3 equ 0xdd ; page 0
PCA0CPM4 equ 0xde ; page 0
PCA0PWM  equ 0xdf ; page 0
;ACC     equ 0xe0
XBR0     equ 0xe1 ; page 0
XBR1     equ 0xe2 ; page 0
XBR2     equ 0xe3 ; page 0
IT01CF   equ 0xe4 ; page 0
EIE1     equ 0xe6
EIE2     equ 0xe7
ADC0CN0  equ 0xe8 ; page 0
PCA0CPL1 equ 0xe9 ; page 0
PCA0CPH1 equ 0xea ; page 0
PCA0CPL2 equ 0xeb ; page 0
PCA0CPH2 equ 0xec ; page 0
PCA0CPL3 equ 0xed ; page 0
PCA0CPH3 equ 0xee ; page 0
RSTSRC   equ 0xef ; page 0
;B       equ 0xf0
P0MDIN   equ 0xf1 ; page 0
P1MDIN   equ 0xf2 ; page 0
P2MDIN   equ 0xf3 ; page 0
SMB0ADR  equ 0xf4 ; page 0
SMB0ADM  equ 0xf5 ; page 0
EIP1     equ 0xf6
EIP2     equ 0xf7
SPI0CN0  equ 0xf8 ; page 0
PCA0L    equ 0xf9 ; page 0
PCA0H    equ 0xfa ; page 0
PCA0CPL0 equ 0xfb ; page 0
PCA0CPH0 equ 0xfc ; page 0
PCA0CPL4 equ 0xfd ; page 0
PCA0CPH4 equ 0xfe ; page 0
VDM0CN   equ 0xff ; page 0

